app/Controllers/Pages.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-27'
ORDER BY `id` ASC
---
    public function welcome(): string
    {
        $today = date('Y-m-d');
        return view('pages/welcome', [
            'today' => $today,
            'tasks' => (new TaskModel())->where('task_date', $today)->orderBy('id', 'ASC')->findAll(),